import { StaticImageData } from "next/image";
import Img1 from "./../../../public/heroImage/1.png";
import Img2 from "./../../../public/heroImage/2.png";
import Img3 from "./../../../public/heroImage/3.png";


const heroData: {
  title: string;
  description: string;
  image: string | StaticImageData;
}[] = [
  {
    title: "بهترین اسپری های مردانه ایرانی و خارجی در قالب مهرنوش",
    description:
      "فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها",
    image: Img1,
  },
  {
    title: "بهترین شامپو های بدن و مو ایرانی و خارجی در قالب مهرنوش",
    description:
      "فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها",
    image: Img2,
  },
  {
    title: "لوسین های خارجی برای بانوان بصورت کاملا گیاهی و طبیعی",
    description:
      "فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها",
    image: Img3,
  },
];


export default heroData